Revit 2026 API

# SurfaceGetBoundingBoxUV Method

---

Gets the UV bounding box of the surface.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BoundingBoxUV GetBoundingBoxUV()
```
```vb
Public Function GetBoundingBoxUV As BoundingBoxUV
```
```cpp
public:
BoundingBoxUV^ GetBoundingBoxUV()
```
```fsharp
member GetBoundingBoxUV : unit -> BoundingBoxUV
```

#### Return Value

BoundingBoxUV The UV bounding box of the surface.

The UV bounding box may not be set.

#### Reference

Surface Class

Autodesk.Revit.DB Namespace